Repository: american-worx/helpy
Catalog: helpy_ninja_project/helpy_ninja/lib/l10n/app_*.arb
Languages: vi

source: Welcome
vi: Chào mừng

source: Meet Your Helpy
vi: Gặp gỡ Helpy của bạn

# personalAITutor
source: Your personal AI tutor that learns with you, grows with you
vi: Gia sư AI cá nhân học cùng bạn, phát triển cùng bạn

source: Get Started
vi: Bắt đầu

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Password
vi: Mật khẩu

source: Ask Helpy anything...
vi: Hỏi Helpy bất cứ điều gì...

source: Helpy is thinking
vi: Helpy đang suy nghĩ

source: Chat
vi: Trò chuyện

source: Home
vi: Trang chủ

source: Learn
vi: Học tập

source: Profile
vi: Hồ sơ

source: Settings
vi: Cài đặt

source: Dark Mode
vi: Chế độ tối

source: Language
vi: Ngôn ngữ

source: Loading...
vi: Đang tải...

source: Error
vi: Lỗi

source: Offline
vi: Ngoại tuyến

source: Online
vi: Trực tuyến

source: Start Your Learning Journey!
vi: Bắt đầu hành trình học tập!

# chooseHelpyPersonality
source: Choose a Helpy personality to begin chatting and get personalized help with your studies.
vi: Chọn một phong cách Helpy để bắt đầu trò chuyện và nhận được sự hỗ trợ cá nhân hóa cho việc học của bạn.

source: Choose Your Helpy
vi: Chọn Helpy của bạn

source: See All Personalities
vi: Xem tất cả phong cách

source: Start First Chat
vi: Bắt đầu cuộc trò chuyện đầu tiên

source: Oops! Something went wrong
vi: Ồ! Có lỗi xảy ra

source: Try Again
vi: Thử lại

source: Conversation not found
vi: Không tìm thấy cuộc trò chuyện

source: Failed to load messages
vi: Không thể tải tin nhắn

source: Retry
vi: Thử lại

source: New Chat
vi: Trò chuyện mới

source: Choose Your Helpy Personality
vi: Chọn tính cách Helpy của bạn

source: unread messages
vi: tin nhắn chưa đọc

source: Mark as Read
vi: Đánh dấu đã đọc

source: Archive
vi: Lưu trữ

source: Delete
vi: Xóa

source: Archive feature coming soon!
vi: Tính năng lưu trữ sắp ra mắt!

source: Delete Conversation
vi: Xóa cuộc hội thoại

# deleteConversationConfirm
source: Are you sure you want to delete "{title}"? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa "{title}"? Hành động này không thể hoàn tác.

source: Cancel
vi: Hủy

source: Conversation deleted
vi: Đã xóa cuộc hội thoại

# failedToDeleteConversation
source: Failed to delete conversation: {error}
vi: Không thể xóa cuộc hội thoại: {error}

# failedToStartChat
source: Failed to start chat: {error}
vi: Không thể bắt đầu trò chuyện: {error}

source: Choose Your Subjects
vi: Chọn môn học của bạn

# stepXOfY
source: Step {step} of {total}
vi: Bước {step} trong tổng số {total}

# subjectsSelected
source: {count} subjects selected
vi: {count} môn học đã chọn

source: Please select at least one subject
vi: Vui lòng chọn ít nhất một môn học

source: Continue to Helpy Setup
vi: Tiếp tục thiết lập Helpy

# errorSavingSubjects
source: Error saving subjects: {error}
vi: Lỗi khi lưu môn học: {error}

source: Mathematics
vi: Toán học

source: Physics
vi: Vật lý

source: Chemistry
vi: Hóa học

source: Biology
vi: Sinh học

source: Computer Science
vi: Khoa học máy tính

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

source: French
vi: Tiếng Pháp

source: Spanish
vi: Tiếng Tây Ban Nha

source: History
vi: Lịch sử

source: Geography
vi: Địa lý

source: Economics
vi: Kinh tế

source: Visual Arts
vi: Mỹ thuật

source: Music
vi: Âm nhạc

source: Languages
vi: Ngôn ngữ

source: Social Studies
vi: Khoa học xã hội

source: Arts
vi: Nghệ thuật

source: Good morning
vi: Chào buổi sáng

source: Good afternoon
vi: Chào buổi chiều

source: Good evening
vi: Chào buổi tối

source: Ready to continue learning?
vi: Sẵn sàng tiếp tục hành trình học tập của bạn?

# daysSingular
source: day
vi: ngày

# daysPlural
source: days
vi: ngày

source: streak!
vi: liên tiếp!

source: Your Progress
vi: Tiến độ của bạn

source: Track your learning journey
vi: Theo dõi hành trình học tập của bạn

source: Loading progress data...
vi: Đang tải dữ liệu tiến độ...

source: Please enter your email
vi: Vui lòng nhập email của bạn

# pleaseEnterValidEmail
source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

# errorSavingProfile
source: Error saving profile: {error}
vi: Lỗi khi lưu hồ sơ: {error}

source: Keep up the great work!
vi: Tiếp tục phát huy nhé!

source: Lessons Completed
vi: Bài Học Đã Hoàn Thành

source: Achievements
vi: Thành Tích

source: Study Time
vi: Thời Gian Học

source: On Track
vi: Đúng Tiến Độ

source: Behind Goal
vi: Chậm Tiến Độ

# continueLearningComingSoon
source: Continue learning feature coming soon!
vi: Chức năng tiếp tục học sẽ sớm ra mắt!

# practiceQuizComingSoon
source: Practice quiz feature coming soon!
vi: Chức năng luyện tập câu hỏi sẽ sớm ra mắt!

# studyGroupsComingSoon
source: Study groups feature coming soon!
vi: Chức năng nhóm học tập sẽ sớm ra mắt!

source: Full activity history coming soon!
vi: Lịch sử hoạt động đầy đủ sẽ sớm ra mắt!

source: View all activities coming soon!
vi: Xem tất cả hoạt động sẽ sớm ra mắt!

source: Just now
vi: Vừa xong

# minutesAgo
source: {minutes} minutes ago
vi: {minutes} phút trước

# hoursAgo
source: {hours} hours ago
vi: {hours} giờ trước

# daysAgo
source: {days} days ago
vi: {days} ngày trước

source: {percent}% complete
vi: {percent}% hoàn thành

source: Quick Actions
vi: Hành Động Nhanh

source: Get started with these actions
vi: Bắt đầu với những hành động này

source: Start New Chat
vi: Bắt Đầu Trò Chuyện Mới

source: Browse Subjects
vi: Duyệt Môn Học

source: Practice Quiz
vi: Luyện Tập Câu Hỏi

source: My Progress
vi: Tiến Độ Của Tôi

source: Study Groups
vi: Nhóm Học Tập

source: Recent Activity
vi: Hoạt Động Gần Đây

source: No recent activity yet
vi: Chưa có hoạt động gần đây

# startLearningToSeeProgress
source: Start learning to see your progress here
vi: Bắt đầu học để xem tiến độ của bạn ở đây

source: Your Learning Timeline
vi: Dòng thời gian học tập của bạn

source: View All
vi: Xem Tất Cả

source: View
vi: Xem

source: more activities
vi: hoạt động khác

source: Your progress in different subjects
vi: Tiến độ của bạn trong các môn học khác nhau

# lessonStartFailed
source: Failed to start lesson: {error}
vi: Không thể bắt đầu bài học: {error}

source: Lesson bookmarked!
vi: Bài học đã được đánh dấu!

# lessonSharing
source: Sharing lesson...
vi: Đang chia sẻ bài học...

# lessonReportSubmitted
source: Lesson report submitted successfully
vi: Báo cáo đã được gửi

source: Lesson Complete!
vi: Hoàn thành bài học!

# lessonCompleteMessage
source: Congratulations! You have successfully completed this lesson.
vi: Chúc mừng! Bạn đã hoàn thành bài học này thành công.

source: Continue Learning
vi: Tiếp tục học tập

source: Lesson not found
vi: Không tìm thấy bài học

# quizStartFailed
source: Failed to start quiz: {error}
vi: Không thể bắt đầu bài kiểm tra: {error}

# noQuestionsAvailable
source: No questions available for this lesson
vi: Không có câu hỏi nào cho bài học này

source: Quiz Practice
vi: Luyện tập kiểm tra

source: Question {number}
vi: Câu hỏi {number}

# scoreLabel
source: Score: {correct}/{total}
vi: Điểm: {correct}/{total}

source: Explanation
vi: Giải thích

source: Unlocked Achievements
vi: Thành tích đã mở khóa

source: Locked Achievements
vi: Thành tích bị khóa

source: Progress Analytics
vi: Phân tích tiến độ

source: Weekly Progress
vi: Tiến độ hàng tuần

source: Weekly Goal
vi: Mục tiêu hàng tuần

source: Average Per Day
vi: Trung bình mỗi ngày

source: Subject Progress
vi: Tiến độ môn học

# lessonsCount
source: {count} Lessons
vi: {count} Bài học

# progressLabel
source: Progress
vi: Tiến độ

# completionLabel
source: Completion
vi: Hoàn thành

source: Lessons
vi: Bài học

source: Study Time Analytics
vi: Phân tích thời gian học tập

source: Total Study Time
vi: Tổng thời gian học tập

source: Average Per Session
vi: Trung bình mỗi buổi

source: Most Active
vi: Hoạt động nhất

source: Streak Analytics
vi: Phân tích chuỗi học tập

source: Current Streak
vi: Chuỗi hiện tại

source: Longest Streak
vi: Chuỗi dài nhất

# keepGoingOnFire
source: Keep going, you're on fire! ðŸš’
vi: Tiếp tục phát huy, bạn đang rất tích cực! 🚒

# startStudyingToBuildStreak
source: Start studying to build your streak
vi: Bắt đầu học để xây dựng chuỗi học tập của bạn

# monday
source: Mon
vi: Thứ Hai

# tuesday
source: Tue
vi: Thứ Ba

# wednesday
source: Wed
vi: Thứ Tư

# thursday
source: Thu
vi: Thứ Năm

# friday
source: Fri
vi: Thứ Sáu

# saturday
source: Sat
vi: Thứ Bảy

# sunday
source: Sun
vi: Chủ Nhật

source: Morning
vi: Buổi sáng

source: Afternoon
vi: Buổi chiều

source: Evening
vi: Buổi tối

source: Night
vi: Ban đêm

source: Days
vi: Ngày

source: Group Sessions
vi: Phiên Học Nhóm

source: Create Group Session
vi: Tạo Phiên Học Nhóm

source: Join Group Session
vi: Tham gia Phiên Học Nhóm

source: Leave Group Session
vi: Rời khỏi Phiên Học Nhóm

source: Group Session Name
vi: Tên Phiên Học Nhóm

source: Participants
vi: Người tham gia

source: Helpy Participants
vi: Helpy tham gia

source: Send Message to Group
vi: Gửi tin nhắn đến nhóm

# groupSessionCreated
source: Group session created successfully
vi: Phiên học nhóm đã được tạo thành công

# groupSessionJoined
source: Joined group session successfully
vi: Đã tham gia phiên học nhóm thành công

# groupSessionLeft
source: Left group session successfully
vi: Đã rời khỏi phiên học nhóm thành công

# failedToCreateGroupSession
source: Failed to create group session: {error}
vi: Không thể tạo phiên học nhóm: {error}

# failedToJoinGroupSession
source: Failed to join group session: {error}
vi: Không thể tham gia phiên học nhóm: {error}

# failedToLeaveGroupSession
source: Failed to leave group session: {error}
vi: Không thể rời khỏi phiên học nhóm: {error}

source: Group session not found
vi: Không tìm thấy phiên học nhóm

source: Active
vi: Hoạt động

source: Inactive
vi: Không hoạt động

source: Left
vi: Đã rời đi

source: Disconnected
vi: Mất kết nối

source: Group Session Active
vi: Phiên Học Nhóm Đang Hoạt Động

source: Group Session Paused
vi: Phiên Học Nhóm Tạm Dừng

source: Group Session Completed
vi: Phiên Học Nhóm Đã Hoàn Thành

source: Group Session Cancelled
vi: Phiên Học Nhóm Đã Bị Hủy

# noGroupSessions
source: No group sessions yet
vi: Chưa có phiên học nhóm nào

# startGroupSession
source: Start a group session to collaborate with other students and Helpys!
vi: Bắt đầu một phiên học nhóm để hợp tác với các học sinh và Helpy khác!

source: Group message sent
vi: Tin nhắn nhóm đã được gửi

# failedToSendGroupMessage
source: Failed to send group message: {error}
vi: Không thể gửi tin nhắn nhóm: {error}

# groupTyping
source: {name} is typing...
vi: {name} đang nhập...

# multipleGroupTyping
source: {count} people are typing...
vi: {count} người đang nhập...

source: Change Helpy
vi: Thay đổi Helpy

source: Complete Lesson
vi: Hoàn thành bài học

source: Correct
vi: Đúng

source: Correct Answer
vi: Câu trả lời đúng

source: Correct Answers
vi: Câu trả lời đúng

source: Encouraging
vi: Khuyến khích

# failedToChangeHelpy
source: Failed to change Helpy: {error}
vi: Không thể thay đổi Helpy: {error}

# failedToLoadConversations
source: Failed to load conversations: {error}
vi: Không thể tải cuộc trò chuyện: {error}

# failedToLoadHelpy
source: Failed to load Helpy: {error}
vi: Không thể tải Helpy: {error}

# failedToSendMessage
source: Failed to send message: {error}
vi: Không thể gửi tin nhắn: {error}

source: Friendly
vi: Thân thiện

source: Great Job!
vi: Làm tốt lắm!

# helpyChanged
source: Helpy changed successfully
vi: Helpy đã được thay đổi thành công

source: Helpy not found
vi: Không tìm thấy Helpy

# helpyOffline
source: Helpy is offline
vi: Helpy đang ngoại tuyến

# helpyOnline
source: Helpy is online
vi: Helpy đang trực tuyến

source: Helpy Personality
vi: Tính cách Helpy

# helpyThinking
source: Helpy is thinking...
vi: Helpy đang suy nghĩ...

# helpyTyping
source: Helpy is typing...
vi: Helpy đang nhập...

source: Incorrect
vi: Sai

source: Incorrect Answers
vi: Câu trả lời sai

source: Keep Practicing!
vi: Tiếp tục luyện tập!

# lastSeen
source: Last seen {time}
vi: Lần cuối thấy {time}

source: Lesson Completed
vi: Bài học đã hoàn thành

source: Lesson Viewer
vi: Trình xem bài học

source: Message delivered
vi: Tin nhắn đã được gửi

source: Message failed
vi: Tin nhắn thất bại

source: Message read
vi: Tin nhắn đã đọc

source: Message sent
vi: Tin nhắn đã gửi

source: Need More Study!
vi: Cần học thêm!

source: Next Section
vi: Phần tiếp theo

source: No conversations yet
vi: Chưa có cuộc trò chuyện nào

source: of
vi: trong số

source: Online now
vi: Đang trực tuyến

source: Patient
vi: Kiên nhẫn

source: Perfect Score!
vi: Điểm tuyệt đối!

source: Playful
vi: Vui nhộn

source: Previous Section
vi: Phần trước

source: Professional
vi: Chuyên nghiệp

source: Quiz Completed
vi: Bài kiểm tra đã hoàn thành

source: Quiz Feedback
vi: Phản hồi bài kiểm tra

source: Quiz Results
vi: Kết quả bài kiểm tra

source: Quiz Score
vi: Điểm bài kiểm tra

source: Retake Quiz
vi: Làm lại bài kiểm tra

source: Review Answers
vi: Xem lại câu trả lời

source: Section
vi: Phần

source: Select Helpy
vi: Chọn Helpy

source: Send Message
vi: Gửi tin nhắn

# startAConversation
source: Start a conversation with your Helpy to begin learning!
vi: Bắt đầu một cuộc trò chuyện với Helpy của bạn để bắt đầu học!

source: Take Quiz
vi: Làm bài kiểm tra

source: Time
vi: Thời gian

source: Time Taken
vi: Thời gian thực hiện

source: Total Questions
vi: Tổng số câu hỏi

source: Type your message...
vi: Nhập tin nhắn của bạn...

source: typing...
vi: đang nhập...

source: Unanswered
vi: Chưa trả lời

source: Wise
vi: Thông thái

source: Your Answer
vi: Câu trả lời của bạn

source: Track your learning timeline
vi: Dòng thời gian học tập của bạn
